import 'file:///D:/pa6ota/android/flutter_campus_map/lib/widgets/Class.dart';

class ScheduleData {
  List<Class> monday = [
    new Class('8:30', '10:05', 'Web-программирование (ЛБ)', 'Небаба С.Г.', 'КЦ',
        '418'),
    new Class(
        '10:25', '12:00', 'Основы языка С# (ЛБ)', 'Рыжова С.Е.', '10', '209Б'),
    new Class(
        '10:25', '12:00', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '12:40', '14:15', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '10:25', '12:00', 'Основы языка С# (ЛБ)', 'Рыжова С.Е.', '10', '209Б'),
    new Class(
        '10:25', '12:00', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '12:40', '14:15', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '10:25', '12:00', 'Основы языка С# (ЛБ)', 'Рыжова С.Е.', '10', '209Б'),
    new Class(
        '10:25', '12:00', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '12:40', '14:15', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),

  ];

  List<Class> tuesday = [
    new Class('8:30', '10:05', 'Говно какое-то (ЛБ)', 'Небаба С.Г.', 'КЦ',
        '418'),
    new Class(
        '10:25', '12:00', 'Основы языка С# (ЛБ)', 'Рыжова С.Е.', '10', '209Б'),
    new Class(
        '10:25', '12:00', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
    new Class(
        '12:40', '14:15', 'Электроника (ЛБ)', 'Заревич А.И.', '10', '402А'),
  ];
}